Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Показать карту сценария — для навигации открывается уменьшенная копия области построения Сценария с возможностью масштабирования;
en: Show workflow outline enables to open for the navigation purposes a reduced copy of the Workflow construction area suitable for scaling.

source: Показать родительские узлы для производных — при наличии производных узлов показывает родительские узлы;
en: Show parent nodes for derived shows parent nodes if derived nodes are available.

source: Показать/ Скрыть панель компонентов — позволяет открыть или закрыть панель компонентов;
en: Show/Hide component panel enables to open or hide the panel of components.

source: Показать/скрыть инспектор свойств — разворачивает/сворачивает окно Инспектора свойств.
en: Show/hide property inspector enables to expand/collapse the Property inspector window.

source: Полигон;
en: Polygon;

source: Полное описание API
en: Full API Description

source: Предсказываемое
en: Predicted

source: Приблизить — приближает/увеличивает область диаграммы.
en: Zoom in enables to zoom in the chart area.

source: Присоединяемая таблица N, где N порядковый номер таблицы;
en: Joined table N where N is an order number of the table.

source: Присоединяемые переменные N, где N порядковый номер порта переменных.
en: Joined variables N where N is an order number of the variables port.

source: Профили кластеров
en: Cluster Profiles

source: Пузырьковая;
en: Bubble;

source: Разброс;
en: Scatter;

source: Развернуть/Свернуть подмодель — позволяет свернуть выделенные узлы в Подмодель или развернуть выделенную Подмодель на составные узлы;
en: Expand/collapse supernode enables to collapse the selected nodes into the Supernode, or expand the selected Supernode into compound nodes.

source: Режим выбора объекта — режим, использующийся для построения Сценария с помощью стандартных манипуляций;
en: Object selection mode: the mode used for the Workflow construction by means of standard manipulations.

source: Режим навигации по сценарию — режим, использующийся для навигации по области построения Сценария с помощью мышки;
en: Workflow navigation mode: the mode used for navigation in the Workflow construction area by means of a mouse.

source: Режим перетаскивания — позволяет передвигать диаграмму по экрану (см.
en: Drag mode enables to move the chart on the screen (refer to

source: Режим приближения — увеличивает масштаб просмотра выделенной области (см.
en: Pointer mode enables to zoom in the selected area view (also refer to

source: Сбросить приближение Y — снимает приближение диаграммы по оси Y, но оставляет приближение по оси X.
en: Reset zoom Y enables to reset zooming in of the chart along the Y axis but the X axis zooming in is preserved.

source: Сбросить приближение — снимает все настройки приближения (по обеим осям).
en: Reset zoom enables to reset all zoom in settings (for both axes).

source: Сверху.
en: Top.

source: Сглаженные области с интервалами;
en: Smoothed areas with intervals;

source: Сглаженные области;
en: Smoothed areas;

source: Слева сверху.
en: Top left.

source: Слева снизу.
en: Bottom left.

source: Слева.
en: Left.

source: Снизу.
en: Bottom.

source: Соединение
en: Column Union

source: Создать производный компонент — создает Производный компонент на основе выделенного узла;
en: Create derived component enables to create the Derived Component based on the selected node.

source: Сортировка
en: Sort

source: Сплайны;
en: Splines;

source: Справа сверху.
en: Top right.

source: Справа снизу.
en: Bottom right.

source: Справа.
en: Right.

source: Статистика
en: Statistics

source: Столбчатая с интервалами;
en: Columns with ranges;

source: Столбчатая;
en: Columns;

source: Строковый
en: String

source: Строковый, Переменный
en: String, Variable

source: Тип данных не задан
en: No data type specified

source: Транзакция
en: Transaction

source: Удалить все.
en: Delete all.

source: Удалить выбранное — удаляет выделенные узлы/связи Сценария;
en: Delete selected enables to delete the selected nodes/links of the Workflow.

source: Удалить конкретную серию.
en: Delete a given series.

source: Удалить — удаление выбранного Производного компонента.
en: Delete: delete the selected Derived Component.

source: Удалить — удаление выделенного в списке Производного компонента.
en: Delete: delete the Derived Component selected in the list.

source: Файловое хранилище
en: File Storage

source: Формат
en: Format

source: Формирование XML
en: XML Generation

source: Целый
en: Integer

source: Целый, Вещественный, Переменный
en: Integer, Real, Variable

source: Целый;
en: Integer;

source: Экспорт — позволяет сохранить диаграмму, как она выглядит в окне просмотра в файл с изображением.
en: Export enables to save the chart as it is displayed in the view window in the file with an image.

source: Элемент
en: Item

source: — Коэффициенты регрессионной модели (таблица данных).
en: — Regression model coefficients (data table).

source: — Сводка (переменные).
en: — Summary (variables).

source: — Управляющие переменные (переменные) — необязательный порт, переменными можно задать значения параметров мастера настройки.
en: — Control variables (variables) — optional port. It is possible to set values of the wizard parameters using variables.

source: — Коэффициенты регрессионной модели — таблица данных;
en: — Regression model coefficients: data table.

source: — Сводка — переменные.
en: — Summary: variables.

source: — Входной источник данных (таблица данных) — обязательный порт;
en: — Input data source (data table) — required port.

source: — Выход регрессии — таблица, состоящая из полей: регрессия поля выходных данных, поля исходного набора данных;
en: — Regression output: the table that consists of the following fields: field regression of output data, source data set.

source: — Выход регрессии.
en: — Regression output.

source: — Выходной набор данных (таблица с ответами сервиса);
en: — Output data set (table with the service responses);

source: — Дополнительные данные (таблица с результатами выполнения запросов, описанием ошибок).
en: — Additional data (table with the results of requests execution, errors description).

source: — входной порт;
en: — input port;

source: — выполнение процесса не начиналось, произошла ошибка.
en: — the process execution has not started yet, an error occurred.

source: — выходной порт.
en: — output port.

source: — добавляет новое поле в таблицу;
en: adds a new field to the table;

source: — значение параметра задается вручную;
en: — the parameter value is manually set.

source: — значение параметра задается переменной.
en: — the parameter value is set by the variable.

source: — идет процесс обработки, и время его окончания невозможно рассчитать заранее;
en: — processing is in progress, and it is not possible to calculate its termination time in advance.

source: — информация о результатах выполнения процесса еще не получена;
en: — information on the process execution results has not been received yet.

source: — остановить все процессы.
en: — stop all processes.

source: — остановить конкретный процесс.
en: — stop a given process.

source: — при выполнении процесса произошла ошибка (обработка не завершена);
en: — an error occurred while the process execution (processing is not completed).

source: — прогресс выполнения текущего процесса по мере обработки данных;
en: — execution progress of the current process as data is processed.

source: — удалить все завершенные процессы.
en: — delete all completed processes.

source: — удалить из списка конкретный процесс.
en: — delete a given process from the list.

source: — удаляет все поля в новой таблице.
en: deletes all fields in the new table.

source: — успешное выполнение (обработка завершена);
en: — successful completion (processing is completed).

source: — устанавливает перечень и параметры полей, как в таблице, подключенной к входному порту обработчика;
en: sets the list and features of fields as in the table connected to the input port of the handler;

source: / — перемещают выделенное поле, определяя его положение в списке полей создаваемой таблицы;
en: / moves the selected field defining its position in the list of fields of the created table;

source: <ServerName>:<Port>:<SID> либо
en: <ServerName>:<Port>:<SID> or

source: <ServerName>, где ServerName — хост сервера СУБД, как указано в конфигурационном файле tnsnames.ora сервера Oracle.
en: <ServerName> where ServerName: the DBMS server host as stated in tnsnames.ora configuration file of Oracle server.

source: <ServerName>[:<Port>]/<Service_name>, где:
en: <ServerName>[:<Port>]/<Service_name> where:

source: Удалить все... — удаляет все дочерние узлы (комбинация горячих клавиш Shift+Delete).
en: Delete all... enables to delete all child nodes (combination of Shift+Delete hotkeys).

source: Loginom — аналитическая платформа, позволяющая в единой среде выполнить все этапы бизнес-анализа от консолидации данных и построения моделей до визуализации и интеграции в бизнес-процесс.
en: Loginom is an analytical platform that enables to execute all business analysis stages in the uniform environment from data consolidation and model training to visualization and integration into business process.

source: ROC-кривая — зависимость TPR от FPR.
en: ROC curve: dependence of TPR on FPR.

source: Автокорреляция — это понятие математической статистики, которое характеризует степень статистической взаимосвязи между элементами данных одного временного ряда.
en: Autocorrelation is a concept related to mathematical statistics that defines the level of statistical interrelation between data elements of one time series.

source: Горизонт прогноза — задает количество значений, которые будут спрогнозированы и добавлены в выходной набор в конце исходного временного ряда.
en: Forecast horizon sets the number of the values that will be forecast and added to the output data set at the end of the source time series.

source: Детализация — отображает данные исходного набора данных, отфильтрованные по выделенным в Основной таблице кластерам.
en: Detailing shows the source data set data filtered by the clusters selected in the Main table.

source: Настройка внешнего разбиения — появляется, если задан порт Внешние диапазоны квантования.
en: Configure External Binning appears if External binning ranges port is set.

source: Настройка конечных классов — позволяет просматривать начальные классы и результаты формирования конечных классов.
en: Configure Coarse Classes enables to view the fine classes and results of the coarse classes generation.

source: Настройка назначений столбцов — позволяет задать назначение столбцам, настройки входного и выходного полей, внешнего разбиения, а также настройки алгоритма для формирования конечных классов входных полей.
en: Configure Column Usage Types: it enables to set the column usage type, configuration of the input and output fields, external binning and algorithm settings to generate the coarse classes of the input fields.

source: Основная таблица — отображает информацию о паре <кластер, поле>;
en: Main table displays information on <cluster, field>.

source: Панель инструментов — содержит настройку отображаемых данных;
en: Toolbar provides configuration of the displayed data.

source: Панель сравнения кластеров — содержит сравнительную информацию по кластерам, выделенным в Основной таблице;
en: Cluster comparison panel contains the comparative information on the clusters selected in the Main table.

source: Панель фильтрации — содержит настройки фильтрации Основной таблицы;
en: Filtration panel contains filtration settings of the Main table.

source: Удалить все условия Удалить все условия — удалить все условия для выбранной ветви.
en: Delete all conditions Delete all conditions enables to delete all conditions for the selected branch.

source: Фильтр
en: Filter

source: = — Равно;
en: = — Equals.

source: > — Больше;
en: > — Greater than.

source: >= — Больше или равно.
en: >= — Greater than or equal to.

source: A1 — в формате, в котором строка ячейки обозначается латинскими буквами, а столбец — цифрами.
en: A1: according to this format, the row cells are identified in Latin characters, and a column is identified in figures.

source: AMGD(Стоимость, Остаточная\_стоимость, Время\_эксплуатации, Период)
en: AMGD(Cost, Residual\_cost, Operating\_time, Period)

source: AND — операция Логическое "И";
en: AND: the Logical "AND" operator;

source: ARIMAX (AutoRegressive Integrated Moving Average eXtended) — это математическая модель для анализа временных рядов, объединяющая в себе интегрированную авторегрессию, скользящее среднее и возможность учета дополнительных внешних факторов.
en: ARIMAX (AutoRegressive Integrated Moving Average eXtended) is a mathematical model for analysis of time series that combines integrated autoregression, moving average and possibility to consider additional exogenous factors.

source: AUC PR — выводит площадь под PR-кривой.
en: AUC PR shows the area under the PR curve.

source: AUC ROC — выводит площадь под ROC-кривой.
en: AUC ROC shows the area under the ROC curve.

source: Abs(Аргумент)
en: Abs(Argument)

source: AbsErr(Аргумент1, Аргумент2)
en: AbsErr(Argument1, Argument2)

source: Adapter — необязательный компонент.
en: Adapter: optional component.

source: AddDay(Дата, Количество)
en: AddDay(Date, Number)

source: AddMonth(Дата, Количество)
en: AddMonth(Date, Number)

source: AddQuarter(Дата, Количество)
en: AddQuarter(Date, Number)

source: AddWeek(Дата, Количество)
en: AddWeek(Date, Number)

source: AddYear(Дата, Количество)
en: AddYear(Date, Number)

source: Alt + 1 — Alt + 8 — перейти на страницу с номером;
en: Alt + 1 — Alt + 8: go to the page with number;

source: Alt + F5 — обновить список папок и их параметров.
en: Alt + F5 enables to update the list of folders and their parameters.

source: Alt + F5 — обновить список пользователей и их параметров.
en: Alt + F5: update the list of users and their parameters.

source: ArcCos(Значение)
en: ArcCos(Value)

source: ArcSin(Значение)
en: ArcSin(Value)

source: ArcTan(Значение)
en: ArcTan(Value)

source: Avg(Аргумент1, Аргумент2 ...)
en: Avg(Argument1, Argument2 ...)

source: C:\Program Files (x86)\Microsoft Office\Office14\EXCEL.EXE — указывается абсолютный путь до исполняемого файла.
en: C:\Program Files (x86)\Microsoft Office\Office14\EXCEL.EXE: the absolute path to the executed file is specified.

source: CRC32(Строка)
en: CRC32(String)

source: Chr(Аргумент)
en: Chr(Argument)

source: Chrome не ниже 39.0
en: Chrome 39.0 or higher

source: Concat(Строка, Строка , ...
en: Concat(String, String , ...

source: Cos(Угол)
en: Cos(Angle)

source: Count(Строка)
en: Count(String)

source: CreateGUID(Формат = "B", ВерхнийРегистр = True)
en: CreateGUID(Format = "B", UpperCase = True)

source: Ctrl + Down — переместить строку в Детализации вниз.
en: Ctrl + Down: move down the row in Detailing.

source: Ctrl + F — поиск текущего выделенного значения;
en: Ctrl + F: search for the current selected value;

source: Ctrl + G — перейти к строке;
en: Ctrl + G: go to the row;

source: Ctrl + Left — перейти на предыдущую страницу;
en: Ctrl + Left: go to the previous page;

source: Ctrl + Right — перейти на следующую страницу;
en: Ctrl + Right: go to the next page;

source: Ctrl + Up — переместить строку в Детализации вверх;
en: Ctrl + Up: move up the row in Detailing;

source: DKhi2(Степени\_свободы, Аргумент)
en: DKhi2(Degrees\_of\_freedom, Argument)

source: DamLevDist(Строка1, Строка2)
en: DamLevDist(String1, String2)

source: Data("ИмяСтолбца",НомерСтроки)
en: Data("ColumnName",RowNumber)

source: DatabaseName — имя базы, содержащей необходимые данные.
en: DatabaseName: the name of the database that includes the required data.

source: DateTimeToStr(Дата\_время [, Формат\_даты , Формат\_времени])
en: DateTimeToStr(Date\_time [, Date\_format , Format\_of time])

source: DateToStr(Дата , Формат\_даты)
en: DateToStr(Date , Date\_format)

source: Day(Дата)
en: Day(Date)

source: DayOfWeek(Дата)
en: DayOfWeek(Date)

source: DaysBetween(Дата1, Дата2)
en: DaysBetween(Date1, Date2)

source: Decode(Выражение, Значение1, Результат1 , Значение2, Результат2... , Значение\_по\_умолчанию = "")
en: Decode(Expression, Value1, Result1 , Value2, Result2... , Default\_value= "")

source: DecodeF(Выражение, Погрешность, Значение1, Результат1 , Значение2, Результат2... , Значение\_по\_умолчанию = 0)
en: DecodeF(Expression, Error, Value1, Result1 , Value2, Result2... , Default\_value = 0)

source: DecodeN(Выражение, Значение1, Результат1 , Значение2, Результат2... , Значение\_по\_умолчанию = 0)
en: DecodeN(Expression, Value1, Result1 , Value2, Result2... , Default\_value = 0)

source: DecodeS(Выражение, Значение1, Результат1 , Значение2, Результат2... , Значение\_по\_умолчанию = "")
en: DecodeS(Expression, Value1, Result1 , Value2, Result2... , Default\_value = "")

source: DecodeV(Выражение, Значение, Результат , Значение, Результат... , Значение\_по\_умолчанию = Null)
en: DecodeV(Expression, Value, Result , Value, Result... , Default\_value = Null)

source: Deductor Warehouse проводит все необходимые операции по подключению к реляционной СУБД и выборке нужной информации прозрачно для пользователя.
en: Deductor Warehouse performs all required operations to connect to the relational DBMS and select necessary information that is rather transparent for a user.

source: Deductor Warehouse — это собственный формат Хранилища данных, специально разработанный для использования с Loginom и Deductor.
en: Deductor Warehouse is the own format of Data Warehouse elaborated specially for usage with Loginom and Deductor.

source: Delete — удалить папку;
en: Delete: delete folder.

source: Delete — удалить пользователя из системы;
en: Delete: delete user from the system.

source: DisplayName("Имя")
en: DisplayName("Name")

source: Down — перейти на строку ниже;
en: Down: go down to row.

source: EM Кластеризация;
en: EM clustering.

source: Elastic-Net — модель регрессии с двумя регуляризаторами L1, L2.
en: Elastic-Net: regression model with two regularizers - L1, L2.

source: EncodeDate(Год, Месяц, День)
en: EncodeDate(Year, Month, Day)

source: EncodeDateTime(Год, Месяц, День, Часы, Минуты, Секунды)
en: EncodeDateTime(Year, Month, Day, Hours, Minutes, Seconds)

source: EncodeTime(Часы, Минуты, Секунды)
en: EncodeTime(Hours, Minutes, Seconds)

source: End + Alt — перейти на последнюю строку таблицы;
en: End + Alt: go to the last table row;

source: End — перейти на последнюю колонку строки таблицы;
en: End: go to the last column of the table row;

source: Excel-файл
en: Excel file

source: Exp(Степень)
en: Exp(Degree)

source: F-тест.
en: F-test.

source: F2 — редактировать папку;
en: F2: edit folder.

source: F2 — редактировать пользователя;
en: F2: edit user.

source: F3 — перейти к следующему найденному значению;
en: F3: go to the next found value;

source: F1 score — является средним гармоническим значением Точности и Чувствительности.
en: F1 score means the average harmonic value of Accuracy and Sensitivity.

source: FALSE — Ложь;
en: FALSE: the false value.

source: FKhi2(Степени\_свободы, Аргумент)
en: FKhi2(Degrees\_of\_freedom, Argument)

source: Factorial(Аргумент)
en: Factorial(Argument)

source: False negative (FN) — количество неверно классифицированных отрицательных примеров.
en: False negative (FN): the number of incorrectly classified negative cases.

source: False negative rate (FNR) — доля неверно классифицированных отрицательных примеров от общего количества положительных примеров.
en: False negative rate (FNR): rate of incorrectly classified negative cases based on the total number of positive cases.

source: False positive (FP) — количество неверно классифицированных положительных примеров.
en: False positive (FP): the number of incorrectly classified positive cases.

source: False positive rate (FPR) — доля неверно классифицированных положительных примеров от общего количества отрицательных примеров.
en: False positive rate (FPR): rate of incorrectly classified positive cases based on the total number of negative cases.

source: Find(Подстрока, Строка, Порядок = 1)
en: Find(Substring, String, MatchIndex = 1)

source: Firebird — версия 2.5 и выше;
en: Firebird: version 2.5 and higher.

source: Firefox не ниже 52.0
en: Firefox 52.0 or higher

source: Format(Строка\_формата, Выражение , ...
en: Format(Format\_string, Expression , ...

source: Frac(Аргумент)
en: Frac(Argument)

source: GET — при выборе данного метода доступны следующие настройки:
en: GET: when selecting this method, the following settings are available:

source: HTML — сохранить текущее представление в формате HTML.
en: HTML: save the current view in the HTML format.

source: Home + Alt — перейти на первую строку таблицы;
en: Home + Alt: go to the first table row;

source: Home — перейти на первую колонку строки таблицы;
en: Home: go to the first column of the table row;

source: Hour(ДатаВремя)
en: Hour(DateTime)

source: IF(Условие, Значение1, Значение2)
en: IF(Antecedent, Value1, Value2)

source: IFF(Условие, Значение1, Значение2)
en: IFF(Antecedent, Value1, Value2)

source: IN(Значение, Элемент1, Элемент2, ..., ЭлементN)
en: IN(Value, Element1, Element2, ..., ElementN)

source: IV (информационный индекс).
en: IV (information value).

source: InputTables[N], где N — номер (индекс) порта.
en: InputTables[N] where N is a port number (index).

source: Insert — добавить нового пользователя;
en: Insert: insert a new user.

source: Insert — добавить новую папку;
en: Insert: insert a new folder.

source: Instance — Oracle Database Instance (SID), содержащий необходимые данные.
en: Instance: Oracle Database Instance (SID) that contains the required data.

source: Int(Аргумент)
en: Int(Argument)

source: Integrator — компонент, отвечающий за публикацию собственных веб-сервисов на основе созданных в Loginom пакетов.
en: Integrator: the component responsible for publication of own web services based on the packages created in Loginom.

source: Internet Explorer не ниже 11.0
en: Internet Explorer 11.0 or higher

source: InvKhi2(Степени\_свободы, Вероятность)
en: InvKhi2(Degrees\_of\_freedom, Probability)

source: IsNull(Аргумент)
en: IsNull(Argument)

source: K-fold кросс-валидация — позволяет выбрать Метод сэмплинга и количество Колод кросс-валидации.
en: K-fold cross validation enables to select the Method of sampling and number of Cross validation fold.

source: L1 — реализует это путём отбора наиболее важных факторов, которые сильнее всего влияют на результат.
en: L1 implements it by selecting the most important factors that have the highest impact on the result.

source: L2 — предотвращает переобучения модели путём запрета на непропорционально большие весовые коэффициенты.
en: L2 prevents from the model overfitting by forbidding disproportionately large weighted coefficients.

source: LASSO — также как и Ridge, применяется для борьбы с переизбыточностью данных.
en: LASSO is used to avoid data redundancy as Ridge.

source: LGD-файл
en: LGD file

source: LOCALIZED — языкозависимое сравнение символов Unicode без чувствительности к регистру.
en: LOCALIZED: the language dependent Unicode character collation without case sensitivity.

source: LZO (рекомендуется, используется по умолчанию).
en: LZO (it is recommended and used by default)

source: Left(Строка, Количество\_символов)
en: Left(String, Count\_of\_characters)

source: LevDist(Строка1, Строка2)
en: LevDist(String1, String2)

source: Ln(Аргумент)
en: Ln(Argument)

source: Log(Основание, Аргумент)
en: Log(Basis, Argument)

source: Loginom Data File (LGD-файл) — это собственный формат файла данных, специально разработанный для использования с Loginom.
en: Loginom Data File (LGD file) is the own format of the data file elaborated specially for usage with Loginom.
